#ifndef TRANSLIT_H

#define TRANSLIT_H


#include <string>


using std::string;


//!Этот файл должен быть в CP1251
#define TEST_NAME "русский имя.frm"

char rus_chars[] = 
//0    1    2    3    4    5    6    7    8    9    10   11   12   13   14   15   16   17   18   19   20   21   22   23   24   25   26   27   28   29   30   31   32
{'А', 'Б', 'В', 'Г', 'Д', 'Е', 'Ё', 'Ж', 'З', 'И', 'Й', 'К', 'Л', 'М', 'Н', 'О', 'П', 'Р', 'С', 'Т', 'У', 'Ф', 'Х', 'Ц', 'Ч', 'Ш', 'Щ', 'Ъ', 'Ы', 'Ь', 'Э', 'Ю', 'Я',
'а', 'б', 'в', 'г', 'д', 'е', 'ё', 'ж', 'з', 'и', 'й', 'к', 'л', 'м', 'н', 'о', 'п', 'р', 'с', 'т', 'у', 'ф', 'х', 'ц', 'ч', 'ш', 'щ', 'ъ', 'ы', 'ь', 'э', 'ю', 'я'};

string trs_chars[] = 
																											 		   //'CH', 'SH', 'JH', 'H', 'IH', 'Y', 'EH', 'U', 'YA',
//0    1    2    3    4    5    6    7    8    9    10   11   12   13   14   15   16   17   18   19   20   21   22   23   24H   25H   26H   27    28H  29   30H   31    32
{"A", "B", "V", "G", "D", "E", "E", "J", "Z", "I", "Y", "K", "L", "M", "N", "O", "P", "R", "S", "T", "U", "F", "H", "SC", "CH", "SH", "SCH", "H", "YH", "Y", "EH", "YU", "YA",
"a", "b", "v", "g", "d", "e", "e", "j", "z", "i", "y", "k", "l", "m", "n", "o", "p", "r", "s", "t", "u", "f", "h", "sc", "ch", "sh", "sch", "h", "yh", "y", "eh", "yu", "ya"};

string trs_chars_alt[] = 
//0    1    2    3    4    5    6    7    8    9    10   11   12   13   14   15   16   17   18   19   20   21   22   23   24r   25r   26r   27r  28r  29r  30r   31r    32r
{"A", "B", "V", "G", "D", "E", "E", "J", "Z", "I", "Y", "K", "L", "M", "N", "O", "P", "R", "S", "T", "U", "F", "H", "C", "H", "S", "S", "H", "Y", "I", "E", "U", "A",
"a", "b", "v", "g", "d", "e", "e", "j", "z", "i", "y", "k", "l", "m", "n", "o", "p", "r", "s", "t", "u", "f", "h", "c", "h", "s", "s", "h", "y", "i", "e", "u", "a"};


#endif // TRANSLIT_H